GitConverter/src/Catalogs/ВерсииХранилища/ВерсииХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииХранилища</name>
  <owners>Catalog.ХранилищаКонфигураций</owners>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогФайловКонфигурации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияВерсии</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВременныхФайлов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ХранилищаКонфигураций</types>
      <types>CatalogRef.ОчередиВыполнения</types>
      <types>CatalogRef.КопииХранилищКонфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМетаданных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгрузкаИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>sha1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

GitConverter/src/Enums/СостоянияВерсии/СостоянияВерсии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияВерсии</name>
  <enumValues>
    <name>ПолучениеВерсии</name>
  </enumValues>
  <enumValues>
    <name>ВерсияПолучена</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаВерсии</name>
  </enumValues>
  <enumValues>
    <name>ВерсияВыгружена</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаМетаданных</name>
  </enumValues>
  <enumValues>
    <name>МетаданныеЗагружены</name>
  </enumValues>
  <enumValues>
    <name>НачалоКоммита</name>
  </enumValues>
  <enumValues>
    <name>ВерсияПомещена</name>
  </enumValues>
</mdclass:Enum>

GitConverter/src/Catalogs/ВерсииХранилища/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Отбор = Новый Структура();
	Если ЗначениеЗаполнено(ТекущийОбъект.Источник) Тогда
		Отбор.Вставить("Ключ", Строка(ТекущийОбъект.Источник.УникальныйИдентификатор()));
	Иначе
		Отбор.Вставить("Ключ", Строка(ТекущийОбъект.Ссылка.УникальныйИдентификатор()));
	КонецЕсли; 
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	
	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	
	Если МассивФоновыхЗаданий.Количество() > 0 Тогда
		Задание = МассивФоновыхЗаданий[0];
		СостояниеЗадания = НСтр("ru='Выполняется обработка с %Дата%'");
		СостояниеЗадания = СтрЗаменить(СостояниеЗадания, "%Дата%", Задание.Начало);
		
		Элементы.ГруппаСостояние.Видимость = Истина;
		ФоновоеЗаданиеПрочитатьПромежуточныйРезультат(Задание.УникальныйИдентификатор);
		
	Иначе
		СостояниеЗадания = "";
		Элементы.ГруппаСостояние.Видимость = Ложь;
	КонецЕсли;
	
	Если ТекущийОбъект.Состояние = Перечисления.СостоянияВерсии.НачалоКоммита 
		ИЛИ ТекущийОбъект.Состояние = Перечисления.СостоянияВерсии.ВерсияПомещена Тогда
		КаталогВыгрузкиВерсий = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.Владелец, "КаталогВыгрузкиВерсий");
		ИмяФайлаЛога = КонвертацияХранилища.ИмяФайлаЛогаКоммитаВерсии(ТекущийОбъект.Код, КаталогВыгрузкиВерсий);
	Иначе
		ИмяФайлаЛога = КонвертацияХранилища.ИмяФайлаЛогаОбработкиВерсии(ТекущийОбъект.КаталогВременныхФайлов);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапуститьОбработкуВерсии(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьОбработкуВерсииНаСервере(Объект.Ссылка);
	
	Прочитать();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояние(Команда)
	
	Прочитать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяФайлаЛогаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Не ЗначениеЗаполнено(ИмяФайлаЛога) Тогда
		Возврат;
	КонецЕсли;
	
	Текст = Новый ТекстовыйДокумент();
	
	ИмяФайла = "";
	ПрочитатьТекстовыйФайлНаСервере(ИмяФайлаЛога, Текст, ИмяФайла);
	
	Текст.Показать(ИмяФайла, ИмяФайла);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗапуститьОбработкуВерсииНаСервере(ВерсияХранилища)
	
	КонвертацияХранилища.ЗапуститьОбработкуВерсииВФоне(ВерсияХранилища);
	
КонецПроцедуры

&НаСервере
Процедура ФоновоеЗаданиеПрочитатьПромежуточныйРезультат(ФоновоеЗаданиеИдентификатор)
	Прогресс = ДлительныеОперации.ПрочитатьПрогресс(ФоновоеЗаданиеИдентификатор);
	Если Прогресс <> Неопределено Тогда
		ФоновоеЗаданиеПроцент   = Прогресс.Процент;
		ФоновоеЗаданиеСостояние = Прогресс.Текст;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПрочитатьТекстовыйФайлНаСервере(ПутьКФайлу, Текст, ИмяФайла, КодировкаСистемы = Ложь)
	
	ОбщегоНазначения.ПрочитатьТекстовыйФайл(ПутьКФайлу, Текст, ИмяФайла, КодировкаСистемы);
	
КонецПроцедуры

#КонецОбласти
